Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/carers/carers_benefit.html.txt.tmx
Source language: en
Languages: ga

source: Carer's Benefit is a payment made to insured people who leave the workforce to care for a person(s) in need of full-time care and attention
ga: Íoctar Sochar Cúramóra le daoine le hárachas in Éirinn a fhágann an líon saothair chun aire a thabhairt do dhuine nó do dhaoine ar ghá cúram lánaimseartha a thabhairt dóibh

source: You can get Carer's Benefit for a total period of 104 weeks for each person being cared for
ga: Féadfaidh tú Sochar Cúramóra do thréimhse 104 seachtain san iomlán i gcás gach duine a bhfuil tú ag déanamh cúram dó nó di

source: This may be claimed as a single continuous period or in any number of separate periods up to a total of 104 weeks
ga: Is féidir é seo a éileamh mar thréimhse leanúnach amháin nó ina chodanna de thréimhsí éagsúla a bheidh 104 seachtain iontu san iomlán

source: However, if you claim Carer's Benefit for less than six consecutive weeks in any given period you must wait for a further six weeks before you can claim Carer's Benefit to care for the same person again
ga: Má éilíonn tú Sochar Cúramóra i gcás tréimhse níos lú ná sé seachtaine leanúnacha i dtréimhse ar bith ní mór duit fanacht sé seachtaine eile sula n-éilíonn tú Sochar Cúramóra chun cúram a thabhairt don duine céanna arís

source: If you are caring for more than one person, you may receive payment for each care recipient for 104 weeks
ga: Más rud é go bhfuil tú ag tabhairt cúram do bhreis agus duine amháin, féadfaidh tú íocaíocht a fháil ar feadh 104 seachtain i gcás gach duine acu

source: This may result in the care periods overlapping or running concurrently
ga: Féadfaidh na tréimhsí cúraim forluí ar a chéile nó a bheith i gcomhthráth le chéile

source: The Carer's Support Grant is an annual payment made to carers by the Department of Social Protection
ga: Is deontas airgid thirim é an Deontas Cúraim Faoisimh a íoctar le cúramóirí

source: It was formerly called the Respite Care Grant, but was renamed the Carer's Support Grant to better reflect how it is used by carers
ga: Is féidir le cúramóirí an deontas a úsáid pé slí ar mian leo

source: It is paid on the first Thursday in June of each year
ga: Bíonn na híocaíochtaí bhliantúla i leith cúraim faoisimh iníoctha ar an gcéad Déardaoin i Meitheamh gach bliain

source: Find out more about respite care
ga: Léigh tuilleadh faoi chúram faoisimh anseo

source: Your right to carer's leave from employment complements the Carer's Benefit Scheme
ga: Comhlánaíonn an ceart atá agat maidir le cearta cúramóra um shaoire ó fhostaíocht Scéim Sochar Cúramóra maidir le saoire

source: Carer's leave allows you to leave your employment temporarily for up to 104 weeks to provide full-time care for people in need of full-time care and attention
ga: Tugann saoire cúramóra cead d'fhostaithe an fhostaíocht atá acu a fhágáil go sealadach ar feadh tréimhse nach mó ná 104 sheachtain chun cúram lánaimseartha a thabhairt do dhaoine a bhfuil gá acu le cúram agus aire lánaimsire

source: The leave is unpaid but people who take carer's leave have their jobs kept open for the duration of the leave
ga: Ní íocfar iad le linn na saoire seo ach i gcás na ndaoine ar mhian leo saoire chúramóra a ghlacadh coinneofar a jabanna in áirithe dóibh ar feadh na saoire

source: You do not have to be eligible for Carer's Benefit to get carer's leave
ga: Ní gá go mbeifeá i dteideal Sochar Cúramóra a fháil le bheith i dteideal saoire cúramóra a bheith agat

source: If you think you have been wrongly refused Carer's Benefit, or you are unhappy about a decision of a social welfare deciding officer about your entitlements, you can appeal this decision
ga: Más dóigh leat gur diúltaíodh Sochar Chúramóra go héagórach duit nó mura bhfuil tú sásta le cinneadh a rinne Oifigeach Cinnidh Leasa Shóisialaigh faoi na teidlíochaí atá agat, tá sé de rogha agat achomharc a dhéanamh in aghaidh an chinnidh seo

source: You may be eligible for Carer's Benefit if:
ga: D'fhéadfá a bheith i dteideal Sochar Cúramóra a fháil:

source: • You are aged 16 or over and under 66
ga: • Má tá tú 16 bliana d'aois agus faoi bhun 66

source: • You have been employed for at least 8 weeks, whether consecutive or not, in the previous 26 week period
ga: • Má bhí tú fostaithe ar feadh ocht seachtain i rith an 26 seachtain sular oibrigh tú mar chúramóir

source: You must be in employment for a minimum of 16 hours per week or 32 hours per fortnight
ga: Ní mór duit 16 uaire oibre a bheith déanta agat in aghaidh na seachtaine nó 32 uaire in aghaidh na coicíse

source: You don't have to meet this condition if you were getting Carer's Benefit in the previous 26 weeks
ga: Ní gá duit an choinníoll seo a chomhlíonadh má bhí Sochar Cúramóra á fháil agat i rith an 26 seachtain roimhe seo

source: • You give up work in order to be a full-time carer
ga: • Má d'éirigh tú as obair le bheith i do chúramóir lánaimsire

source: Being a full-time carer means you must be living with or in a position to provide full-time care and attention to a person in need of care who is not living in an institution
ga: Is éard is brí le bheith i do chúramóir lánaimsire ná a bheith i do chónaí le duine (nach bhfuil ag cur faoi nó fúithi in institiúid) a bhfuil cúram agus aire lánaimsire ag teastáil uaidh nó uaithi nó go bhfuil sé ar do chumas iad sin a thabhairt don té sin

source: • You are not living in a hospital, convalescent home or other similar institution
ga: • Níl tú ag cur fút in ospidéal, i dteach téarnaimh nó in institiúid dá leithéid

source: However, you may continue to be regarded as providing full-time care and attention, if you or the person being cared for is having medical or other treatment in a hospital or other institution for a period not longer than 13 weeks
ga: Áfach, má fhaigheann tú nó an duine a thugann tú aire dó/dí cóireáil leighis in ospidéil ar feadh 13 seachtain nó níos lú, glactar leat bheith ag tabhairt cúram agus aire lán aimseartha

source: • You meet the PRSI contribution conditions
ga: • Ní mór duit coinníollacha Árachas Sóisialach Pá-Choibhneasa a shásamh

source: • The person being cared for is so incapacitated as to require full-time care and attention and is not normally living in an institution
ga: • Ní mór don duine sin atá faoi do chúram agat a bheith chomh míchumasaithe sin go bhfuil cúram lánaimsire riachtanach dó nó di agus nach bhfuil an té sin ag cur faoi nó fúithi in institiúid. Ní mór teastas dochtúra a sholáthar

source: Medical certification is required unless the person being cared for is a child who is getting Domiciliary Care Allowance
ga: Níl teastas dochtúra riachtanach má tá Liúntas Chúram sa Teaghais á íoc ag Limistéar de chuid Feidhmeannacht na Seirbhíse Sláinte i leith linbh

source: The carer of a child on a Domiciliary Care Allowance does not need to be the person who receives that allowance on the child's behalf
ga: Ní gá gurbh é nó í an cúramóir an duine a fhaigheann an Liúntas Chúram sa Teaghais thar cheann an linbh

source: • You must not take part in employment, self-employment, training or education courses outside the home for more than 15 hours a week
ga: • Ní féidir leat a bheith ag obair mar fhostaí nó féinfhostaithe ar feadh breis agus 15 n-uaire sa tseachtain

source: The maximum amount you can earn is €332.50 per week
ga: Is é an t-uasmhéid gur féidir leat a thuilleamh in aghaidh na seachtaine ná €332.50

source: (€332.50 is your net income after you have deducted income tax and Universal Social Charge, PRSI, superannuation (pension payments), pension levy, union dues, subscriptions to Friendly Societies and any health insurance contract premium from your total wage.)
ga: (Is é €332.50 do ghlanioncam tar éis duit do cháin ioncaim agus an Muirir Sóisialta Uilíoch, PRSI, aoisliúntas (íocaíochtaí pinsin), éileamh pinsin, costais cheardchumainn, an phréimh árachais sláinte agus do shíntiúis chuig Cumainn Chairdiúla ó d'íocaíocht iomláin.)

source: You must have at least 156 contributions paid at any time between your entry into insurance and the time you make your claim for Carer's Benefit and:
ga: Ní mór duit 156 ranníocaíocht ar a laghad a bheith déanta agat ón am a chuaigh tú isteach sa scéim árachais go dtí an t-am a dhéanann tú an t-iarratas ar Shochar Chúramóra, agus

source: • 39 contributions paid in the Relevant Tax Year or
ga: • 39 ranníocaíocht a bheith déanta agat sa Bhliain Chánach iomchuí, nó

source: • 39 contributions paid in the 12-month period before the start of Carer's Benefit or
ga: • 39 ranníocaíocht déanta sa tréimhse 12 mí sular thosaigh an Sochar Cúramóra, nó

source: • 26 contributions paid in the Relevant Tax Year and 26 contributions paid in the year before that
ga: • 26 ranníocaíocht déanta sa Bhliain Chánach Iomchuí agus 26 ranníocaíocht sa bhliain roimhe sin

source: Only contributions at Class A, B, C, D, H and E can be counted towards Carer's Benefit
ga: Ní féidir ach amháin ranníocaíochtaí ag Aicme ÁSPC A, B, C, D, E agus H a chur san áireamh i dtreo Sochair Cúramóra

source: Class S (self-employed contributions) do not count
ga: Ní chuirtear Aicme S (ranníocaíochtaí féinfhostaithe) san áireamh

source: The Relevant Tax Year is the second last complete tax year before the year in which you make your claim. So, for claims made in 2017, the Relevant Tax Year is 2015
ga: Is í an dara bliain iomlán cánach deireanach roimh an mbliain ina ndéanann tú d'éileamh an Bhliain Chánach Iomchuí, mar shampla, is í 2013 an Bhliain Chánach Iomchuí i gcás éilimh a dhéantar i 2015

source: Periods of insurance in another EU member state may be taken into account to meet the PRSI contribution conditions
ga: D'fhéadfaí tréimhsí árachais a críochnaíodh i mballstát eile de chuid an AE a chur san áireamh, chun na coinníollacha ranníocaíochta ÁSPC a chomhlíonadh

source: The last week of insurance must be paid in Ireland
ga: Is gá gur íocadh an tseachtain dheireanach oibre d'árachas íoctha in Éirinn

source: You are awarded credited contributions or credits automatically when you are getting Carer's Benefit
ga: Tabharfar íocaíochtaí curtha do shochar (creidmheasanna) duit gan iad a iarradh i gcás na tréimhse sin ina bhfuil tú ag fáil Sochar Cúramóra

source: Credits are awarded at the same rate as your last paid contribution
ga: Tugtar creidmheasanna ar an ráta céanna leis an ranníocaíocht dheireannach a rinne tú

source: These credits help protect your future entitlement to social welfare benefits and pensions
ga: Cinnteoidh na creidmheasanna seo nach gcaillfidh tú teidlíocht do shochar leasa shóisialaigh ná do phinsin amach anseo

source: You can claim an increase for a child if they are under age 18, normally live with you and are maintained by you
ga: Féadfaidh tú méadú a éileamh i leith linbh atá faoi bhun 18, atá ina c(h)ónaí leat de ghnáth más tusa a bhíonn á c(h)othú

source: If a child is in full-time education by day at a recognised school or college this increase is payable until the end of the academic year in which the the child reaches age 22
ga: Má tá leanbh ag fáil oideachais lánaimsire lae i scoil nó i gcoláiste aitheanta tá an méadú seo iníoctha go deireadh na bliana acadúla sin ina shroicheann an leanbh aois a 22

source: (This child does not have to live at home)
ga: (Ní gá don leanbh a bheith ag cur faoi nó fúithi sa bhaile

source: A full-rate Increase for a Qualified Child (IQC) is payable if you are single, widowed, separated or a civil partner who is not living with the other civil partner
ga: Tá an méadú i leith leanaí cleithiúnacha iníoctha is cuma má bhíonn tú singil, i do bhaintreach , scartha ó do chéile nó más páirtnéir sibhialta tú nach bhfuil ina c(h)ónaí leis an páirtnéir sibhialta eile

source: You may get a half-rate IQC if you are living with your spouse, civil partner or cohabitant
ga: Tá leath den mhéadú i leith Leanaí Cleithiúnacha iníoctha má tá tú ag maireachtáil le do chéile/páirtnéir sibhialta/comhchónaitheoir

source: If your spouse, civil partner or cohabitant is getting a payment from the Department of Social Protection, you will each get a half-rate increase
ga: Má tá íocaíocht á fháil ag do chéile/páirtnéir sibhialta/comhchónaitheoir ón Roinn Coimirce Sóisialaí, gheobhaidh an bheirt agaibh araon leath den Mhéadú i leith Leanaí Cleithiúnacha

source: You cannot claim a half-rate IQC with your Carer's Benefit if your spouse, civil partner or cohabitant has an income of over €400 a week
ga: Ó 5 Iúil 2012, más ioncam do chéile, páirtnéir sibhialta ó comhchónaitheoir níos mó ná €400 in aghaidh na seachtaine, ní féidir leat an méadú i leith leanaí cleithiúnacha iníoctha le do Shochar Cúramóra a éileamh a thuilleadh

source: Carer's Benefit is a taxable source of income and should be advised to your local tax office
ga: Is foinse ioncaim incháinithe é seo agus ba chóir duit é sin a chur in iúl do d'oifig chanach áitiúil

source: Continuing the payment after a death
ga: Leanúint ar aghaidh le híocaíocht tar éis báis

source: If the person you are caring for dies, payment of Carer's Benefit will continue for 6 weeks following the death
ga: Má tharlaíonn sé go bhfaigheann an duine a bhfuil tú ag tabhairt cúram dó nó di bás íocfar an Sochar Cúramóra duit go ceann 6 seachtain i ndiaidh a b(h)ás

source: Carer's Benefit rates from 16 March 2017
ga: Rátaí ó 16 Márta 2017

source: │Carer aged under 66 │Maximum weekly rate │
ga: │Sochar │Rataí seachtainiúil │

source: │Caring for 1 person │€210 │
ga: │Dea-chroíoch duine 1 │€210.00 │

source: │Caring for more than 1 │€315 │
ga: │Dea-chroíoch duine 2 │€315.00 │

source: │Increase for each qualified │€29.80 (full rate), €14.90 (half │ │child │rate) │
ga: │Méadú do gach leanbh cáilithe │€29.80 (ráta iomlán), €14.90 (leath-ráta) │

source: You are not entitled to the Household Benefits package and Free Travel under the Carer’s Benefit Scheme
ga: Ní hann d’aon teidlíocht ar Phacáiste na Sochar don Líon Tí ná do Shaorthaisteal faoi Scéim an tSochair Chúramóra

source: To apply fill in an application form for Carer's Benefit (pdf)
ga: Is féidir cóip den fhoirm a bhaineann le Sochar Cúramaí a íoschóipeáil agus a chomhlánú i bhfoirm ag an suíomh (pdf)

source: This form (CARB1) is also available from your local Intreo Centre or Social Welfare Branch Office or from the Carer's Benefit Section, (see 'Where to apply' below)
ga: Tá an fhoirm seo (CARB1) ar fáil freisin ón Ionad Intreo nó Oifig Bhrainse Leasa Shóisialaigh nó ón Rannóg Shochair Chúramaí, (breathnaigh thíos faoin mír cén áit le hiarratas a dhéanamh)

source: The Department of Social Protection recommends that you apply for Carer’s Benefit 10 weeks before you leave employment
ga: Molann an Roinn Coimirce Sóisialaí go ndéanfaidh tú iarratas ar Shochar Cúramóra 10 seachtaine sula mbeidh tú ag fágáil do phost

source: Parts 1, 2, 3 ,5, 6, 7 and 8 should be completed by you
ga: Ba cheart duit codanna 1, 2, 3 ,5, 6, 7 agus 8 a chomhlánú

source: Part 4 should be completed, signed and stamped by your employer
ga: Ba cheart do do fhostóir cuid a 4 a chomhlánú, a shíniú agus a stampáil

source: Part 10 should be completed by the person(s) receiving care from you and his/her doctor should complete, sign and stamp the Medical Report
ga: Ba cheart don duine (na daoine) atá faoi do chúram cuid a 10 a chomhlánú agus ba cheart dá d(h)ochtúir an Tuairisc Leighis a chomhlánú, a shíniú agus a stampáil

source: If you are applying for Carer's Benefit for a second person you should use the application form CARB2 (pdf)
ga: Tá cearta dleathúla tábhachtacha ag Cúramaithe faoi dhlí na hÉireann

source: Carers have important legal rights. If you think your rights as a carer have been breached, you can make a complaint under the Carer’s Leave Act 2001, using the online complaint form (available by selecting ‘Make a complaint in relation to employment rights’ on workplacerelations.ie). Where to apply
ga: Má cheapann tú go bhfuil do chuid cearta cúramaí sáraithe, is féidir gearán a dhéanamh leis an gCoimisiún um Chaidreamh Oibreachais faoin Acht um Shaoire Chúramaí, 2001 (pdf)
